package com.example.androidapp


data class Animals(val name: String, val description: String, val breed: String, val imageResId: Int)

val pet1 = Animals("Юта", "Лиса порода котів." +
        "Велелюбний і товариський вихованець, який легко завойовує серця небайдужих до кішок людей" +
        "Власники цих тварин кажуть, що нізащо не проміняють їх на представників інших порід", "Cфінкс", R.drawable.sfinks)

val pet2 = Animals("Боня", "Це товстенька, але не велика кішка, схожа на плюшеву іграшку. " +
        "Милі ведмежата мають круглі щічки, невеликі вуха та приплюснутий ніс. " +
        "У великих очах світяться гідність й розум. " +
        "Особливості британських кішок і гордість – їхня щільна шерсть.", "Британська кішка", R.drawable.drex)

val pet3 = Animals("Чарльз", "Це компактні і при цьому потужні коти., " +
        "Британські пушистики схожі на плюшевих ведмежат" +
        "У них повні широкі груди, короткі або середньої довжини сильні ноги, округлі лапи", "Британець", R.drawable.british)